In [1]:
import pandas as pd

In [2]:
titanic_df = pd.read_csv('https://raw.githubusercontent.com/rcpsilva/Python_For_Data_Science/main/2022-2/Python%20Notebooks/datasets/titanic.csv')
ports_df = pd.read_csv('https://raw.githubusercontent.com/rcpsilva/Python_For_Data_Science/main/2022-2/Python%20Notebooks/datasets/ports.csv')

In [3]:
titanic_df.head(5)

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S

In [4]:
ports_df.head()

,City,Country,GDP (in billions USD),Population,Area (in square kilometers),Latitude,Longitude,Main Language
0,S,United Kingdom,330.9,254275,51.81,50.9097,-1.4863,English
1,C,France,273.9,37489,489.00,49.6333,1.6167,French
2,Q,Ireland,131.1,19000,12.48,51.8503,-8.2943,Irish

In [5]:
merged_df = pd.merge(titanic_df, ports_df, left_on='Embarked', right_on='City')

In [6]:
merged_df.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked,City,Country,GDP (in billions USD),Population,Area (in square kilometers),Latitude,Longitude,Main Language
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S,S,United Kingdom,330.9,254275,51.81,50.9097,-1.4863,English
1,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S,S,United Kingdom,330.9,254275,51.81,50.9097,-1.4863,English
2,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S,S,United Kingdom,330.9,254275,51.81,50.9097,-1.4863,English
3,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S,S,United Kingdom,330.9,254275,51.81,50.9097,-1.4863,English
4,7,0,1,"McCarthy, Mr. Timothy J",male,54.0,0,0,17463,51.8625,E46,S,S,United Kingdom,330.9,254275,51.81,50.9097,-1.4863,English

In [7]:
# Count the proportion of NaN values in each column
nan_proportion = merged_df.isna().mean()

# Print the proportion of NaN values in each column
print(nan_proportion)

PassengerId                    0.000000
Survived                       0.000000
Pclass                         0.000000
Name                           0.000000
Sex                            0.000000
Age                            0.199100
SibSp                          0.000000
Parch                          0.000000
Ticket                         0.000000
Fare                           0.000000
Cabin                          0.772778
Embarked                       0.000000
City                           0.000000
Country                        0.000000
GDP (in billions USD)          0.000000
Population                     0.000000
Area (in square kilometers)    0.000000
Latitude                       0.000000
Longitude                      0.000000
Main Language                  0.000000
dtype: float64

In [8]:
merged_df = merged_df.drop('Cabin', axis=1)
merged_df = merged_df.drop('Main Language', axis=1)
merged_df = merged_df.drop('PassengerId', axis=1)

In [9]:
# Replace NaNs in 'Age' column with the median value
median_age = merged_df['Age'].median()
merged_df['Age'] = merged_df['Age'].fillna(median_age)

In [10]:
nan_proportion = merged_df.isna().mean()
# Print the proportion of NaN values in each column
print(nan_proportion)

Survived                       0.0
Pclass                         0.0
Name                           0.0
Sex                            0.0
Age                            0.0
SibSp                          0.0
Parch                          0.0
Ticket                         0.0
Fare                           0.0
Embarked                       0.0
City                           0.0
Country                        0.0
GDP (in billions USD)          0.0
Population                     0.0
Area (in square kilometers)    0.0
Latitude                       0.0
Longitude                      0.0
dtype: float64

## Encoders

In [11]:
from sklearn.preprocessing import LabelEncoder

In [12]:
# Create an instance of LabelEncoder
label_encoder = LabelEncoder()

In [13]:
# Iterate over each column
for column in merged_df.columns:
    # Check if the column has non-numerical values
    if merged_df[column].dtype == 'object':
        # Encode non-numerical values using LabelEncoder
        merged_df[column] = label_encoder.fit_transform(merged_df[column].astype(str))

# Print the updated DataFrame
merged_df

,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Embarked,City,Country,GDP (in billions USD),Population,Area (in square kilometers),Latitude,Longitude
0,0,3,108,1,22.0,1,0,522,7.2500,2,2,2,330.9,254275,51.81,50.9097,-1.4863
1,1,3,353,0,26.0,0,0,668,7.9250,2,2,2,330.9,254275,51.81,50.9097,-1.4863
2,1,1,272,0,35.0,1,0,48,53.1000,2,2,2,330.9,254275,51.81,50.9097,-1.4863
3,0,3,15,1,35.0,0,0,471,8.0500,2,2,2,330.9,254275,51.81,50.9097,-1.4863
4,0,1,514,1,54.0,0,0,84,51.8625,2,2,2,330.9,254275,51.81,50.9097,-1.4863
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
884,0,3,428,1,28.0,0,0,65,7.7500,1,1,1,131.1,19000,12.48,51.8503,-8.2943
885,0,3,250,1,28.0,0,0,447,6.9500,1,1,1,131.1,19000,12.48,51.8503,-8.2943
886,1,3,515,1,28.0,0,0,441,7.7500,1,1,1,131.1,19000,12.48,51.8503,-8.2943
887,0,3,683,0,39.0,0,5,479,29.1250,1,1,1,131.1,19000,12.48,51.8503,-8.2943
888,0,3,220,1,32.0,0,0,465,7.7500,1,1,1,131.1,19000,12.48,51.8503,-8.2943